# Assignment 16,17 - Hitik Panchal

In [123]:
import numpy as np
import pandas as pd

# Reading Data

In [5]:
titles = pd.read_csv('title_data.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [9]:
cast = pd.read_csv('cast_data.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [7]:
release_date = pd.read_csv('release_dates.csv')
release_date.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

# Questions

### How many movies are listed in the titles dataframe ?

In [10]:
titles['title'].count()

244914

There are __244914__ movies in the titles Dataframe

### What are the earliest two films listed in the titles dataframe ?

In [11]:
oldest_movie = titles.sort_values("year", axis = 0, ascending = True, inplace = False)
oldest_movie.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet" ?

In [81]:
hamlet_data = pd.DataFrame(titles[titles['title']=='Hamlet'])
hamlet_data.head()

        title  year
6422   Hamlet  2017
10637  Hamlet  1921
39916  Hamlet  1913
52521  Hamlet  1910
62000  Hamlet  2000

In [13]:
hamlet_data['title'].count()

20

There are __20__ movies with title "Hamlet"

### How many movies are titled "North by Northwest" ?

In [14]:
nbn_data = pd.DataFrame(titles[titles['title']=='North by Northwest'])
nbn_data.head()

                    title  year
74398  North by Northwest  1959

In [15]:
nbn_data['title'].count()

1

There is only __1__ movie titled "North by Northwest"

### When was the first movie titled "Hamlet" made ?

In [16]:
oldest_hamlet = hamlet_data.sort_values("year", axis = 0, ascending = True, inplace = False)
oldest_hamlet.head(1)

        title  year
52521  Hamlet  1910

The first movie titled "Hamlet" was made in __1910__

### List all of the "Treasure Island" movies from earliest to most recent .

In [17]:
ti_data = pd.DataFrame(titles[titles['title']=='Treasure Island'])
ti_data['title'].count()

8

In [82]:
asc_ti = ti_data.sort_values("year", axis = 0, ascending = True, inplace = False)
asc_ti

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950 ?

In [19]:
data_1950 = pd.DataFrame(titles[titles['year']== 1950])
data_1950.head()

                  title  year
189  La soif des hommes  1950
268    Sohrab at Rustum  1950
308               Gemma  1950
314        Rasuna valea  1950
524  Trial Without Jury  1950

In [20]:
data_1950['title'].count()

1113

__1113__ movies were made in the year 1950

### How many movies were made in the year 1960 ?

In [21]:
data_1960 = pd.DataFrame(titles[titles['year']== 1960])
data_1960.head()

                     title  year
52     Tayna Dimki Karmiya  1960
88   Tres angelitos negros  1960
226           Viuda de oro  1960
227        Tao se feng yun  1960
590   Mahallenin sevgilisi  1960

In [22]:
data_1960['title'].count()

1549

__1549__ movies were made in the year 1960

### How many movies were made from 1950 through 1959 ?

In [23]:
data_fifties = pd.DataFrame(titles[titles['year']>= 1950])
data_fifties.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [24]:
data_fiftytofiftynine = pd.DataFrame(data_fifties[data_fifties['year']<= 1959])
data_fiftytofiftynine.head()

                 title  year
5           Tight Spot  1955
8      Bao dao mei ren  1956
45  Trois de la marine  1957
48           Hong hong  1956
61     Alarma in munti  1955

In [69]:
data_fiftytofiftynine['year'].count()

12934

__12934__ movies were made from 1950 through 1959

### In what years has a movie titled "Batman" been released ?

In [26]:
batman_data = pd.DataFrame(titles[titles['title']=='Batman'])
batman_data.head()

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception" ?

In [30]:
inception_data = pd.DataFrame(cast[cast['title']=='Inception'])
inception_data.head()

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

In [31]:
inception_data['character'].count()

78

There were __78__ roles in the movie "Inception"

###  How many roles in the movie "Inception" did receive an "n" value ?

In [32]:
inception_data['n'].count()

51

There were __51__ roles in the movie "Inception" which received an "n" value

### How many roles in the movie "Inception" are NOT ranked by an "n" value ?

The roles which didn't receive an 'n' value in the movie "Inception" is __(78 - 51) = 27__

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [35]:
north_data = pd.DataFrame(cast[cast['title']=='North by Northwest'])
north_data.head()

,title,year,name,type,character,n
12668,North by Northwest,1959,Stanley Adams,actor,Lieutenant Harding,NaN
29122,North by Northwest,1959,Andy Albin,actor,Farmer,NaN
56389,North by Northwest,1959,Don Anderson,actor,Worker,NaN
56610,North by Northwest,1959,Ernest Anderson,actor,Porter on Twentieth Century Ltd.,NaN
95950,North by Northwest,1959,Malcolm Atterbury,actor,Man at Prairie Crossing,NaN

In [38]:
north_data.dropna(inplace= True)

In [39]:
north_data.head()

,title,year,name,type,character,n
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0

In [43]:
north_data.sort_values("n", axis = 0, ascending = True, inplace = True)

In [83]:
north_data

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth"

In [45]:
sleuth_data = pd.DataFrame(cast[cast['title']=='Sleuth'])
sleuth_data.head()

         title  year                 name   type          character    n
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
326773  Sleuth  1972        Michael Caine  actor        Milo Tindle  2.0
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
373876  Sleuth  1972       Alec Cawthorne  actor  Inspector Doppler  3.0
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

In [46]:
sleuth_1972 = pd.DataFrame(sleuth_data[sleuth_data['year']==1972])
sleuth_1972.head()

,title,year,name,type,character,n
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0

In [50]:
sleuth_1972.count()

title        6
year         6
name         6
type         6
character    6
n            6
dtype: int64

In [48]:
sleuth_1972.sort_values("n", axis = 0, ascending = True, inplace = True)

In [84]:
sleuth_1972

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth"

In [51]:
sleuth_2007 = pd.DataFrame(sleuth_data[sleuth_data['year']==2007])
sleuth_2007.head()

          title  year                 name   type          character    n
260242   Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
326774   Sleuth  2007        Michael Caine  actor             Andrew  1.0
373877   Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN
1293634  Sleuth  2007             Jude Law  actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter  actor        Man on T.V.  3.0

In [52]:
sleuth_2007.count()

title        7
year         7
name         7
type         7
character    7
n            3
dtype: int64

In [53]:
sleuth_2007.dropna(inplace=True)

In [54]:
sleuth_2007.sort_values("n", axis = 0, ascending = True, inplace = True)

In [85]:
sleuth_2007

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet ?

In [56]:
ham_data = pd.DataFrame(cast[cast['title']=='Hamlet'])
ham_data.head()

        title  year              name   type              character     n
1731   Hamlet  1996        Riz Abbasi  actor  Attendant to Claudius   1.0
7789   Hamlet  1921  Fritz Achterberg  actor            Fortinbras,   9.0
11728  Hamlet  2009      Hayden Adams  actor                Laertes   7.0
11729  Hamlet  2009      Hayden Adams  actor                 Player   7.0
14493  Hamlet  1913       Eric Adeney  actor               Reynaldo  14.0

In [57]:
hamlet_1921 = pd.DataFrame(ham_data[ham_data['year']==1921])
hamlet_1921.head()

          title  year              name   type     character    n
7789     Hamlet  1921  Fritz Achterberg  actor   Fortinbras,  9.0
458904   Hamlet  1921      Paul Conradi  actor  K?nig Hamlet  2.0
555034   Hamlet  1921  Anton De Verdier  actor       Laertes  7.0
1135279  Hamlet  1921   Hans Junkermann  actor      Polonius  6.0
2185558  Hamlet  1921      Heinz Stieda  actor       Horatio  5.0

In [58]:
hamlet_1921['character'].count()

9

__9__ roles were credited in the silent 1921 version of Hamlet

### How many roles were credited in Branaghs 1996 Hamlet ?

In [59]:
hamlet_1996 = pd.DataFrame(ham_data[ham_data['year']==1996])
hamlet_1996.head()

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0

In [60]:
hamlet_1996['character'].count()

54

__54__ roles were credited in Branaghs 1996 Hamlet

### How many "Hamlet" roles have been listed in all film credits through history ?

In [62]:
ham_data['character'].count()`

342

__342__ "Hamlet" roles have been listed in all film credits through history

### How many people have played an "Ophelia" ?

In [63]:
ophelia_data = pd.DataFrame(cast[cast['character']=='Ophelia'])
ophelia_data.head()

,title,year,name,type,character,n
248251,The Merry Maids of Madness,2016,Amy Bourque,actor,Ophelia,11.0
410247,Jake Gets Paid,2009,Josie Chisholm,actor,Ophelia,NaN
470859,Inoperable,2017,Crystal Cordero,actor,Ophelia,NaN
866334,"Dogg's Hamlet, Cahoot's Macbeth",2005,Lucas Grabeel,actor,Ophelia,NaN
1364457,11,2014,Catherine (IV) Lord,actor,Ophelia,NaN

In [64]:
ophelia_data['character'].count()

117

__117__ people have played an "Ophelia"

### How many people have played a role called "The Dude" ?

In [65]:
dude_data = pd.DataFrame(cast[cast['character']=='The Dude'])
dude_data.head()

                         title  year            name   type character     n
272161        The Big Lebowski  1998    Jeff Bridges  actor  The Dude   1.0
339389      Terms & Conditions  2015     Jordan Cann  actor  The Dude   9.0
498660                Stranger  2000   Scott Crowell  actor  The Dude   NaN
570128  Pizza Man vs. the Dude  2004  Chris DeMarcus  actor  The Dude   NaN
610791             Sweepstakes  1931     Mike Donlin  actor  The Dude  12.0

In [66]:
dude_data['character'].count()

19

__19__  people have played a role called "The Dude"

### How many people have played a role called "The Stranger" ?

In [67]:
stranger_data = pd.DataFrame(cast[cast['character']=='The Stranger'])
stranger_data.head()

,title,year,name,type,character,n
25954,Theeb,2014,Hassan Mutlag Al-Maraiyeh,actor,The Stranger,2.0
35748,My Time to Die,2014,Vincent H. Alexander,actor,The Stranger,2.0
46418,Hickok,2017,Terral Altom,actor,The Stranger,NaN
67421,Get Mean,1975,Tony Anthony,actor,The Stranger,1.0
67424,Lo straniero di silenzio,1968,Tony Anthony,actor,The Stranger,1.0

In [68]:
stranger_data['character'].count()

212

__212__ people have played a role called "The Stranger"

### How many roles has Sidney Poitier played throughout his career ?

In [69]:
sidpoi_data = pd.DataFrame(cast[cast['name']=='Sidney Poitier'])
sidpoi_data.head()

,title,year,name,type,character,n
1816209,A Patch of Blue,1965,Sidney Poitier,actor,Gordon Ralfe,1.0
1816210,A Piece of the Action,1977,Sidney Poitier,actor,Manny Durrell,1.0
1816211,A Raisin in the Sun,1961,Sidney Poitier,actor,Walter Lee Younger,1.0
1816212,A Warm December,1973,Sidney Poitier,actor,Dr. Matt Younger,1.0
1816213,All the Young Men,1960,Sidney Poitier,actor,Sgt. Eddie Towler,2.0

In [70]:
sidpoi_data['character'].count()

43

Sidney Poitier has played __43__ roles throughout his career

### How many roles has Judi Dench played ?

In [71]:
judi_data = pd.DataFrame(cast[cast['name']=='Judi Dench'])
judi_data.head()

,title,year,name,type,character,n
2814206,84 Charing Cross Road,1987,Judi Dench,actress,Nora Doel,3.0
2814207,A Handful of Dust,1988,Judi Dench,actress,Mrs. Beaver,13.0
2814208,A Midsummer Night's Dream,1968,Judi Dench,actress,Titania,16.0
2814209,A Room with a View,1985,Judi Dench,actress,"Eleanor Lavish, a novelist",7.0
2814210,A Study in Terror,1965,Judi Dench,actress,Sally,8.0

In [124]:
judi_data['character'].count()

55

Judi Dench has played __55__ roles throughout her career

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year

In [73]:
cary_data = pd.DataFrame(cast[cast['name']=='Cary Grant'])
cary_data.head()

,title,year,name,type,character,n
871388,Alice in Wonderland,1933,Cary Grant,actor,Mock Turtle,10.0
871389,An Affair to Remember,1957,Cary Grant,actor,Nickie Ferrante,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871391,Big Brown Eyes,1936,Cary Grant,actor,Danny Barr,1.0
871392,Blonde Venus,1932,Cary Grant,actor,Nick Townsend,3.0

In [78]:
cary_1940 = pd.DataFrame(cary_data[cary_data['year']>=1940])
cary_1940.head()

,title,year,name,type,character,n
871389,An Affair to Remember,1957,Cary Grant,actor,Nickie Ferrante,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871395,Charade,1963,Cary Grant,actor,Peter Joshua,1.0
871396,Crisis,1950,Cary Grant,actor,Dr. Eugene Norland Ferguson,1.0
871397,Dead Men Don't Wear Plaid,1982,Cary Grant,actor,'Handsome' (in 'Suspicion'),10.0

In [86]:
cary_forties = pd.DataFrame(cary_1940[cary_1940['year']<=1949])
cary_forties.head()

,title,year,name,type,character,n
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871405,George White's Scandals,1945,Cary Grant,actor,Cary Grant,NaN
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0

In [91]:
supp_cary = pd.DataFrame(cary_forties[cary_forties['n']==2.0])

In [88]:
supp_cary.sort_values("year", axis = 0, ascending = True, inplace = True)

In [89]:
supp_cary

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year

In [92]:
lead_cary = pd.DataFrame(cary_forties[cary_forties['n']==1.0])

In [93]:
lead_cary.sort_values("year", axis = 0, ascending = True, inplace = True)

In [94]:
lead_cary

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s ?

In [96]:
roles_1950 = pd.DataFrame(cast[cast['year']>=1950])
roles_1950.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [97]:
roles_fifties = pd.DataFrame(roles_1950[roles_1950['year']<=1959])
roles_fifties.head()

,title,year,name,type,character,n
66,Fire Down Below,1957,'Stretch' Cox Troupe,actor,Limbo Dance by,20.0
68,Dorp aan de rivier,1958,Frans 't Hoen,actor,Dirk Jan,15.0
111,Ci sposeremo a Capri,1956,Quartetto 2+2,actor,Themselves,19.0
119,Die Todesarena,1953,Die 3 Motorellos,actor,Themselves,NaN
288,Palletoori Pilla,1950,Subba Rao A.V.,actor,Kampanna Dora,4.0

In [101]:
actor_fifties = pd.DataFrame(roles_fifties[roles_fifties['type']=='actor'])
actor_fifties.head()

,title,year,name,type,character,n
66,Fire Down Below,1957,'Stretch' Cox Troupe,actor,Limbo Dance by,20.0
68,Dorp aan de rivier,1958,Frans 't Hoen,actor,Dirk Jan,15.0
111,Ci sposeremo a Capri,1956,Quartetto 2+2,actor,Themselves,19.0
119,Die Todesarena,1953,Die 3 Motorellos,actor,Themselves,NaN
288,Palletoori Pilla,1950,Subba Rao A.V.,actor,Kampanna Dora,4.0

In [102]:
actor_fifties['character'].count()

157738

__157738__ roles were available for actors in the 1950s

### How many roles were available for actresses in the 1950s ?

In [103]:
actress_fifties = pd.DataFrame(roles_fifties[roles_fifties['type']=='actress'])
actress_fifties.head()

,title,year,name,type,character,n
2532684,A Woman of Distinction,1950,Lucienne & Ashour,actress,Apache Dancers,NaN
2532686,Chain Lightning,1950,Lucienne & Ashour,actress,Apache Dancers,NaN
2532693,De moedige bruidegom,1952,Hilda 't Seyen,actress,De moeder van Tinneke,NaN
2532730,Cuban Rebel Girls,1959,Beverly Aadland,actress,Beverly Woods,2.0
2532731,Death of a Salesman,1951,Beverly Aadland,actress,Girl,NaN

In [104]:
actress_fifties['character'].count()

57733

 __57733__ roles were available for actresses in the 1950s

### How many leading roles (n=1) were available from the beginning of film history through 1980 ?

In [106]:
roles_1980 = pd.DataFrame(cast[cast['year']<=1980])
roles_1980.head()

,title,year,name,type,character,n
20,Natas es Satan,1977,Ramon 'Cartucho' Pena,actor,Nigth Club Owner,NaN
26,Los tarantos,1963,'El Guisa',actor,Bailaor,25.0
28,Los tarantos,1963,'El Viti',actor,Cantaor,20.0
35,Been Down So Long It Looks Like Up to Me,1971,Murray the 'K',actor,Himself,NaN
36,I Wanna Hold Your Hand,1978,Murray the 'K',actor,Himself,48.0

In [108]:
lead_roles = pd.DataFrame(roles_1980[roles_1980['n']==1.0])
lead_roles.head()

                      title  year         name   type           character    n
300            En glad gutt  1932   Hauk Aabel  actor       Ola Nordistua  1.0
305       En herre med bart  1942    Per Aabel  actor  Ole Grong, advokat  1.0
1087  Batman Fights Dracula  1967  Jing Abalos  actor              Batman  1.0
1088  Batman Fights Dracula  1967  Jing Abalos  actor         Bruce Wayne  1.0
1092            Mighty Rock  1969  Jing Abalos  actor         Mighty Rock  1.0

In [110]:
lead_roles.sort_values("year", axis = 0, ascending = True, inplace = True)
lead_roles

,title,year,name,type,character,n
794541,The Joe Gans-Battling Nelson Fight,1906,Joe Gans,actor,Himself,1.0
3634679,The Story of the Kelly Gang,1906,Elizabeth Tait,actress,Kate Kelly,1.0
1272777,Lika mot lika,1906,Knut Lambert,actor,Coq-H?ron,1.0
818490,Robbery Under Arms,1907,Jim Gerald,actor,Warrigal,1.0
154605,The Fairylogue and Radio-Plays,1908,L. Frank Baum,actor,The Wizard of Oz Man,1.0
...,...,...,...,...,...,...
1023615,Bob Hope's All-Star Comedy Birthday Party at t...,1980,Bob Hope,actor,Himself,1.0
1936027,Charly II,1980,Cliff Robertson,actor,Charly Gordon,1.0
461896,The Private Eyes,1980,Tim Conway,actor,Dr. Tart,1.0
3719837,Nu er xin,1980,Chuan-Ju Wang,actress,Tang Ching Ju,1.0
2713299,Nefeli,1980,Rosana Caskan,actress,Nefeli Zalokosta,1.0

In [109]:
lead_roles['character'].count()

65140

__65140__ leading roles were available from the beginning of film history through 1980

### How many non-leading roles were available through from the beginning of film history through 1980 ?

In [111]:
nonlead_roles = pd.DataFrame(roles_1980[roles_1980['n']!=1.0])
nonlead_roles.head()

,title,year,name,type,character,n
20,Natas es Satan,1977,Ramon 'Cartucho' Pena,actor,Nigth Club Owner,NaN
26,Los tarantos,1963,'El Guisa',actor,Bailaor,25.0
28,Los tarantos,1963,'El Viti',actor,Cantaor,20.0
35,Been Down So Long It Looks Like Up to Me,1971,Murray the 'K',actor,Himself,NaN
36,I Wanna Hold Your Hand,1978,Murray the 'K',actor,Himself,48.0

In [112]:
nonlead_roles.sort_values("n", axis = 0, ascending = True, inplace = True)
nonlead_roles

,title,year,name,type,character,n
3786094,Akdeniz korsanlari,1950,Muazzez ?lkerer,actress,Maria,2.0
3301774,Mia nyhta ston Paradeiso,1951,Linda Miranda,actress,Lina,2.0
3301775,To tragoudi tou horismou,1940,Linda Miranda,actress,Miranda Lambridou,2.0
3301849,Cuatro bodas y pico,1963,Soledad Miranda,actress,Mari-Luci,2.0
3301851,Der Teufel kam aus Akasava,1971,Soledad Miranda,actress,Jane Morgan,2.0
...,...,...,...,...,...,...
3786083,Venner,1960,Bibba ?ygard,actress,Kontordame,NaN
3786087,Bang!,1977,Beate ?rskov,actress,Beate,NaN
3786092,Tokmak Nuri,1975,?lk? ?lker,actress,Hemsire,NaN
3786095,Cemil,1975,G?n?l ?lk?,actress,Alev'in Annesi,NaN
3786096,Tosun Pasa,1976,G?n?l ?lk?,actress,Seferoglu Rukiye,NaN

In [113]:
nonlead_roles['character'].count()

1117667

__1117667__ non-leading roles were available through from the beginning of film history through 1980

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank ?

In [121]:
minor_roles = roles_1980[pd.isnull(roles_1980['n'])]
minor_roles

,title,year,name,type,character,n
20,Natas es Satan,1977,Ramon 'Cartucho' Pena,actor,Nigth Club Owner,NaN
35,Been Down So Long It Looks Like Up to Me,1971,Murray the 'K',actor,Himself,NaN
113,Atemlos vor Liebe,1970,Ballett 2000,actor,Themselves,NaN
116,Thunder in Carolina,1960,2nd Marine Division Band,actor,Themselves,NaN
119,Die Todesarena,1953,Die 3 Motorellos,actor,Themselves,NaN
...,...,...,...,...,...,...
3786083,Venner,1960,Bibba ?ygard,actress,Kontordame,NaN
3786087,Bang!,1977,Beate ?rskov,actress,Beate,NaN
3786092,Tokmak Nuri,1975,?lk? ?lker,actress,Hemsire,NaN
3786095,Cemil,1975,G?n?l ?lk?,actress,Alev'in Annesi,NaN
3786096,Tosun Pasa,1976,G?n?l ?lk?,actress,Seferoglu Rukiye,NaN

In [122]:
minor_roles['character'].count()

448347

__448347__ roles through 1980 were minor enough that they did not warrant a numeric "n" rank